restaurant/ssl/Documents/Зарплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Зарплата</Name>
			<BasedOn>
				<xr:Item>Catalog.Должности</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Зарплата</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаработнаяПлата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

restaurant/ssl/AccumulationRegisters/Зарплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Зарплата</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

restaurant/ssl/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛичныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пол</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Пол</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПриемаНаРаботу</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУвольнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийГрафик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТрудоваяДеятельность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

restaurant/ssl/Catalogs/Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Должности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Описание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаличиеОпыта</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеОбразования</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереченьНавыков</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ГрафикиРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаработнаяПлата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

restaurant/ssl/Documents/Зарплата/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
		
		 // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)      
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды       
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
КонецПроцедуры                    


#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Заполнить(Команда) 
	ЗаполнитьНаСервере();   
	
   КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 &НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Сотрудники.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЗарплатаОстатки.СуммаОстаток, 0) КАК Сумма,
		|	Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
		|		ПО Сотрудники.Должность = Должности.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Зарплата.Остатки(
		|				&Дата,
		|				Ресторан = &Ресторан
		|					И Месяц = &Месяц) КАК ЗарплатаОстатки
		|		ПО Сотрудники.Ссылка = ЗарплатаОстатки.Сотрудник
		|ГДЕ
		|	Сотрудники.Ресторан = &Ресторан";
	
   	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Ресторан", Объект.Ресторан);
	Запрос.УстановитьПараметр("Месяц", Объект.Месяц);     
	РезультатЗапроса = Запрос.Выполнить();
	                                                     
	Выборка = РезультатЗапроса.Выбрать();
	
    Пока Выборка.Следующий() Цикл 
		СтрокаТЧ = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка); 
		
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
		"ВЫБРАТЬ
		|	ДолжностиОписание.ЗаработнаяПлата КАК ЗаработнаяПлата
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Должности.Описание КАК ДолжностиОписание
		|		ПО ДолжностиОписание.Ссылка = Сотрудники.Должность
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";
			
	Запрос2.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
	РезультатЗапроса2 = Запрос2.Выполнить().Выбрать();
		
		Если РезультатЗапроса2.Следующий() Тогда
			СтрокаТЧ.ЗаработнаяПлата = РезультатЗапроса2.ЗаработнаяПлата;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

#КонецОбласти
&НаКлиенте
Процедура СотрудникиАктивенПриИзменении(Элемент)          
	
	ТекСтрокаСотрудники = Элементы.Сотрудники.ТекущиеДанные;
	
	Если ТекСтрокаСотрудники.Оклад Тогда
		ТекСтрокаСотрудники.Сумма = ТекСтрокаСотрудники.Сумма + ТекСтрокаСотрудники.ЗаработнаяПлата;
	Иначе
		ТекСтрокаСотрудники.Сумма = ТекСтрокаСотрудники.Сумма - ТекСтрокаСотрудники.ЗаработнаяПлата;
	КонецЕсли;
КонецПроцедуры

// Объект.Сотрудники.Очистить();

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ЗарплатаОстатки.Сотрудник КАК Сотрудник,
//		|	ЗарплатаОстатки.СуммаОстаток КАК Сумма
//		|ИЗ
//		|	РегистрНакопления.Зарплата.Остатки(
//		|			&Дата,
//		|			Ресторан = &Ресторан
//		|				И Месяц = &Месяц) КАК ЗарплатаОстатки";	
//	
//	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
//	Запрос.УстановитьПараметр("Ресторан", Объект.Ресторан);
//	Запрос.УстановитьПараметр("Месяц", Объект.Месяц);     
//	
//	РезультатЗапроса = Запрос.Выполнить();
	
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл 
//		СтрокаТЧ = Объект.Сотрудники.Добавить();
//		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);      
//		
//	Запрос2 = Новый Запрос;
//		Запрос2.Текст = 
//			"ВЫБРАТЬ
//			|	ДолжностиОписание.ЗаработнаяПлата КАК ЗаработнаяПлата
//			|ИЗ
//			|	Справочник.Сотрудники КАК Сотрудники
//			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Должности.Описание КАК ДолжностиОписание
//			|		ПО ДолжностиОписание.Ссылка = Сотрудники.Должность
//			|ГДЕ
//			|	Сотрудники.Ссылка = &Сотрудник";
//			
//		Запрос2.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
//		РезультатЗапроса2 = Запрос2.Выполнить().Выбрать();
		
//		Если РезультатЗапроса2.Следующий() Тогда
//			СтрокаТЧ.ЗаработнаяПлата = РезультатЗапроса2.ЗаработнаяПлата;
//		КонецЕсли;
//	КонецЦикла;
